---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.GetControlPoints
source: html/409fe43e-03a5-b9d6-5bf4-4f6427e3606e.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.GetControlPoints Method

Get the list of control points.

## Syntax (C#)
```csharp
public IList<XYZ> GetControlPoints()
```